[{"UID":"1","bio":"Principal Architect at Microsoft Research","homepage":"https://www.microsoft.com/en-us/research/people/nickcr/","image":"","institution":"Microsoft Research","session":"","speaker":"Nick Craswell","talk_abstract":"Talk Abstract TBD","talk_title":"Talk Title TBD","title":""},{"UID":"2","bio":"Ed H. Chi is a Distinguished Scientist at Google, leading several machine learning research teams focusing on neural modeling, reinforcement learning, dialog modeling, reliable/robust machine learning, and recommendation systems in Google Brain team. His team has delivered significant improvements for YouTube, News, Ads, Google Play Store at Google with >420 product improvements since 2013. With 39 patents and >150 research articles, he is also known for research on user behavior in web and social media.\nPrior to Google, he was the Area Manager and a Principal Scientist at Palo Alto Research Center's Augmented Social Cognition Group, where he led the team in understanding how social systems help groups of people to remember, think and reason. Ed completed his three degrees (B.S., M.S., and Ph.D.) in 6.5 years from University of Minnesota. Recognized as an ACM Distinguished Scientist and elected into the CHI Academy, he recently received a 20-year Test of Time award for research in information visualization. He has been featured and quoted in the press, including the Economist, Time Magazine, LA Times, and the Associated Press. An avid swimmer, photographer and snowboarder in his spare time, he also has a blackbelt in Taekwondo","homepage":"https://research.google/people/EdChi/","image":"","institution":"Google Research","session":"","speaker":"Ed Chi","talk_abstract":"Talk Abstract TBD","talk_title":"Talk Title TBD","title":""},{"UID":"3","bio":"","homepage":null,"image":"","institution":"Talk Title TBD","session":"","speaker":"Bo Long","talk_abstract":"Vice President of Engineering at JD.COM","talk_title":"Talk Abstract TBD","title":""},{"UID":"4","bio":"","homepage":null,"image":"","institution":"Talk Title TBD","session":"","speaker":"Johanne Trippas","talk_abstract":"Vice-Chancellor's Research Fellow at RMIT","talk_title":"Talk Abstract TBD","title":""}]
