[{"UID":"1","bio":"Principal Architect at Microsoft Research. Nick Craswell is an Australian scientist at Microsoft with 19 years experience in research and product development. He first joined Microsoft in the Cambridge UK research lab, but spent the most time running a science team in Bing in the US. His current product work uses large language models to support information access in Microsoft Office.","homepage":"https://www.microsoft.com/en-us/research/people/nickcr/","image":"","institution":"Microsoft Research","session":"","speaker":"Nick Craswell","talk_abstract":"A fundamental capability in search is to efficiently retrieve the best candidates from millions or billions of candidates. That capability can be used in personalized search, conversational search, and producing grounding text for large language models (LLMs). This talk covers some recent work on the fundamentals (MS MARCO) and additional capabilities needed for personalization and conversation (including \"A theoretical model of conversational search\" by Radlinski and Craswell). For each published work, it then presents toy examples generated by GPT-4 (dv3). The toy examples help us speculate about the impact of LLMs on previous research directions.","talk_title":"Personalization and Conversation (and GPT-4)","title":""},{"UID":"2","bio":"Ed H. Chi is a Distinguished Scientist at Google, leading several machine learning research teams focusing on neural modeling, reinforcement learning, dialog modeling, reliable/robust machine learning, and recommendation systems in Google Brain team. His team has delivered significant improvements for YouTube, News, Ads, Google Play Store at Google with >420 product improvements since 2013. With 39 patents and >150 research articles, he is also known for research on user behavior in web and social media.\nPrior to Google, he was the Area Manager and a Principal Scientist at Palo Alto Research Center's Augmented Social Cognition Group, where he led the team in understanding how social systems help groups of people to remember, think and reason. Ed completed his three degrees (B.S., M.S., and Ph.D.) in 6.5 years from University of Minnesota. Recognized as an ACM Distinguished Scientist and elected into the CHI Academy, he recently received a 20-year Test of Time award for research in information visualization. He has been featured and quoted in the press, including the Economist, Time Magazine, LA Times, and the Associated Press. An avid swimmer, photographer and snowboarder in his spare time, he also has a blackbelt in Taekwondo","homepage":"https://research.google/people/EdChi/","image":"","institution":"Google Research","session":"","speaker":"Ed Chi","talk_abstract":"Talk Abstract TBD","talk_title":"Talk Title TBD","title":""},{"UID":"3","bio":"Dr Johanne Trippas is a Vice-Chancellor’s Research Fellow at the School of Computing Technologies at RMIT University, Australia. She is interested in Intelligent Systems, particularly next-generation capabilities for digital assistants, including spoken conversational search, collection of complex datasets, and task progression through ubiquitous sensing. She is also working with Ambulance Victoria, using artificial intelligence (AI) to identify cardiac arrest emergency calls efficiently. She has built an international reputation as a leader in conversational information-seeking research, especially at the intersection of conversational systems, interactive information retrieval (IIR), human-computer interaction (HCI), and dialogue analysis, with the aim of making information more accessible. Johanne is currently part of the National Institute of Standards and Technology (NIST) Text REtrieval Conference (TREC) program committee and is an ACM Conference on Human Information Interaction and Retrieval (CHIIR) steering committee member. She serves as vice-chair of the SIGIR Artifact Evaluation Committee, tutorial chair for European Conference on Information Retrieval (ECIR) ’24, and ACM SIGIR Conference on Information Retrieval in the Asia Pacific (SIGIR-AP) ’23 proceedings chair.","homepage":"","image":"","institution":"RMIT (Australia)","session":"","speaker":"Johanne Trippas","talk_abstract":"Talk Abstract TBD","talk_title":"Immersive Personalisation for Information Seeking","title":""}]
