[{"UID":"1","bio":"Julian McAuley is a Professor at UC San Diego, where he works on applications of machine learning to problems involving personalization, and teaches classes on personalized recommendation. He likes bicycling and baroque keyboard.","homepage":"https://cseweb.ucsd.edu/~jmcauley/","image":"https://ucsdnews.ucsd.edu/news_uploads/Julian-McAuley.jpg","institution":"UC San Diego","session":"","speaker":"Julian McAuley","talk_abstract":"In this talk, I'll present several case studies demonstrating the risks involved in deploying personalized machine learning algorithms, especially recommender systems. Examples range from problems of mainstream interest (such as filter bubbles and 'extremification'), to more subtle forms of unfairness, such as the loss of utility felt by users whose demographics are poorly represented by marketing content. I'll also discuss various strategies to mitigate these undesired effects, by adapting ideas from 'fair ML' to recommendation scenarios.","talk_title":"The Consequences of Personalized Machine Learning","title":"Prof."},{"UID":"2","bio":"Hamed Zamani is an Assistant Professor in the Manning College of Information and Computer Sciences (CICS) at the University of Massachusetts Amherst, where he also serve as the Associate Director of the Center for Intelligent Information Retrieval (CIIR). His research focuses on designing and evaluating statistical and machine learning models with applications to (interactive) information access systems, including search engines, recommender systems, and question answering. He is currently focusing on Neural Information Retrieval and Conversational Search. Prior to UMass, he was a Researcher at Microsoft, working on a wide range of problems related to search engines. He received my Ph.D. in 2019 from UMass under the direction of W. Bruce Croft. He is the recipient of the UMass CICS Outstanding Dissertation Award for my Ph.D. thesis on weakly supervised neural information retrieval. He obtained his M.Sc. and B.Sc. degrees from the University of Tehran.","homepage":"https://groups.cs.umass.edu/zamani/","image":"https://www.cics.umass.edu/sites/default/files/styles/people_individual/public/headshots/hamed_zamani_550_0.jpg?itok=22AzZ4tE","institution":"UMass Amherst","session":"","speaker":"Hamed Zamani","talk_abstract":"TBD","talk_title":"[Tentative] Conversational AI and joint modeling of Search and Recsys","title":"Prof."},{"UID":"3","bio":"David is a Principal Applied Scientist at Amazon, Israel and an ACM\nDistinguished Engineer. His current research is focused on improving\nproduct search and product question answering through Amazon’s Alexa.\nDavid has published more than 150 papers in IR and Web journals and\nconferences. He served as a general co-chair for WSDM 2021, a\ntechnical program co-chair for CIKM 2019, and an area chair and SPC in\nmany IR and Web conferences. David earned his PhD in Computer Science\nfrom the Technion, Israel Institute of Technology in 1997.","homepage":"https://www.linkedin.com/in/david-carmel-713b483/","image":"https://davidcarmeldotorg.files.wordpress.com/2014/02/davidcarmel.jpg","institution":"Amazon Sciences","session":"","speaker":"David Carmel","talk_abstract":"In this talk I'll discuss the fundamentals of personalized shopping in\neCommerce using voice-based AI assistants like Amazon's Alexa. I'll\ncover some of the recent works done in our lab on personalized\nshopping experience with Alexa, with the focus on product search and\nproduct question answering.","talk_title":"Alexa, Let's Shop. Personalized Shopping Assistance in eCommerce","title":"Dr."}]
